In [2]:
import os

os.chdir("E:/D-drive/DS/data/01 DS ML DL NLP and AI With Python Lab Copy/02.LabData")
os.getcwd()

'E:\\D-drive\\DS\\data\\01 DS ML DL NLP and AI With Python Lab Copy\\02.LabData'

## Exercise 1: wide format to long format

In [6]:
# create a dataframe 
import pandas as pd 
df = pd.DataFrame({"testname":{0:'a',1:'b',2:'c'},
             "patient1":{0:1,1:4,2:8},
             "patient2":{0:2,1:5,2:9},
             "patient3":{0:3,1:6,2:10},
             "patient4":{0:4,1:7,2:11}})
df

  testname  patient1  patient2  patient3  patient4
0        a         1         2         3         4
1        b         4         5         6         7
2        c         8         9        10        11

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 2
Data columns (total 5 columns):
testname    3 non-null object
patient1    3 non-null int64
patient2    3 non-null int64
patient3    3 non-null int64
patient4    3 non-null int64
dtypes: int64(4), object(1)
memory usage: 144.0+ bytes

In [8]:
#df.melt?
#Signature: df.melt(id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)
#Docstring: "Unpivots" a DataFrame from wide format to long format, optionally
            #leaving identifier variables set.

In [11]:
# convert dataframe using melt
df_melt = df.melt(id_vars = ["testname"],
        value_vars=["patient1","patient2","patient3","patient4"],
        var_name = "patients",
        value_name ="readings")
df_melt

   testname  patients  readings
0         a  patient1         1
1         b  patient1         4
2         c  patient1         8
3         a  patient2         2
4         b  patient2         5
5         c  patient2         9
6         a  patient3         3
7         b  patient3         6
8         c  patient3        10
9         a  patient4         4
10        b  patient4         7
11        c  patient4        11

In [12]:
df_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
testname    12 non-null object
patients    12 non-null object
readings    12 non-null int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

### 1.2 Exercise 2: Columns containing values, instead of variables(melt())

In [13]:
import os
os.chdir("E:\\D-drive\\DS\\data\\01 DS ML DL NLP and AI With Python Lab Copy\\02.LabData")

In [14]:
# 01. import required module and load csv file
import pandas as pd

df = pd.read_csv("Py_cleaning_Tidydata.csv")
# 02. Observe data before melting(UNTIDY DATA)
df

           name  treatment a  treatment b
0    John Smith          NaN            2
1      Jane Doe         16.0           11
2  Mary Johnson          3.0            1

In [15]:
# 03. melt and print data
df_melt = pd.melt(frame = df,
                  id_vars = 'name', 
                  value_vars = ['treatment a','treatment b'],
                  var_name = 'treatment',
                  value_name = 'result')
# 04. Observe data after melting(TIDY DATA)
df_melt

           name    treatment  result
0    John Smith  treatment a     NaN
1      Jane Doe  treatment a    16.0
2  Mary Johnson  treatment a     3.0
3    John Smith  treatment b     2.0
4      Jane Doe  treatment b    11.0
5  Mary Johnson  treatment b     1.0

## 2. Pivot (un-melting data)
- Opposite of melting
- In melting, we turned columns into rows
- Pivoting: turn unique values into separate columns
- Violates tidy data principle:
- rows contain observations
- Multiple variables stored in the same column

#### 2.1 Exercise 3: Pivot data

In [16]:
import pandas as pd

df = pd.read_csv("py_cleaning_pivot_data.csv")
df

           name    treatment  result
0    John Smith  treatment a     NaN
1      Jane Doe  treatment a    16.0
2  Mary Johnson  treatment a     3.0
3    John Smith  treatment b     2.0
4      Jane Doe  treatment b    11.0
5  Mary Johnson  treatment b     1.0

In [17]:
#df.pivot?

In [18]:
# 04. pivot the data
df_pivot = df.pivot(index = "name",columns="treatment",values = "result")
# 05. after pivot observe the dataframe 
df_pivot

treatment     treatment a  treatment b
name
Jane Doe             16.0         11.0
John Smith            NaN          2.0
Mary Johnson          3.0          1.0

### 2.2 Exercise 4: Pivot data of duplicate data

In [19]:
# 01. import required modules
import pandas as pd
import numpy as np
# 02. load csv file as dataframe 
df = pd.read_csv("py_cleaning_pivot_data1.csv")
# 03. Observe the dataframe data
df

         date temperature  value
0  2017-09-15        tmax     30
1  2017-09-15        tmin     14
2  2017-09-16        tmax     30
3  2017-09-15        tmax     28
4  2017-09-15        tmin     15

In [20]:
#df.pivot_table?

In [21]:
# 04. pivot the data
df_pivot = df.pivot_table(index = "date",
                          columns="temperature",
                          values = "value",
                          aggfunc = np.mean)
# 05. after pivot observe the dataframe 
df_pivot

temperature  tmax  tmin
date
2017-09-15   29.0  14.5
2017-09-16   30.0   NaN

melt(unpivot) --> wide table into length table --> follows tidy rules
pivot(un melting) --> lenthy table converting into wide table --> not follows tidy rules
pivot_table --> removing duplicates